examples/heatedRoom/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293;

boundaryField
{
    ceiling
    {
        type            externalWallHeatFluxTemperature;
        value           uniform 293;
        kappaMethod     fluidThermo;
        mode            coefficient;
        h  10;
        Ta 273; // its cold its winter
    }

    floor
    {
        type            externalWallHeatFluxTemperature;
        value           uniform 293;
        kappaMethod     fluidThermo;
        mode            coefficient;
        h  10;
        Ta 293; // neighboor appartment
    }

    fixedWalls
    {
        type            externalWallHeatFluxTemperature;
        value           uniform 293;
        kappaMethod     fluidThermo;
        mode            coefficient;
        h  10;
        Ta 273; // its cold its winter
    }

    inlet
    {
        type coupledUniformExternalValue;
        inputName Tin;
        value uniform 350;
        initValue 293;
    }

    outlet
    {
        type zeroGradient;
    }
}


// ************************************************************************* //
